Repository: MoYiha/Ciyue
Catalog: lib/l10n/app_*.arb
Languages: sc

# addDictionary
source: Please add a MDX dictionary in the settings first
sc: In antis annanghe unu ditzionàriu MDX in sas Impostatziones

# startToSearch
source: Start going on a word search :)
sc: Incumintza a fàghere una chirca de paràulas :)

source: Manage Dictionaries
sc: Manìgia sos ditzionàrios

source: Home
sc: Pàgina printzipale

source: Word Book
sc: Libru de paràulas

source: Settings
sc: Impostatziones

# permissionDenied
source: You have to grant the permissions
sc: Depes dare sos permissos

source: Close
sc: Serra

source: Search
sc: Chirca

source: Theme
sc: Tema

source: Light
sc: Craru

source: Dark
sc: Iscuru

source: System
sc: Sistema

source: Language
sc: Limba

source: Lookup
sc: Chirca

source: Not found
sc: No atzapadu

# notSupport
source: Not support this MDX file
sc: Custu archìviu MDX no est suportadu

source: Copy
sc: Còpia

# readLoudly
source: Read Aloud
sc: Leghe a boghe arta

# recommendedDictionaries
source: Recommmended Dictionaries
sc: Ditzionàrios cussigiados

source: Feedback
sc: Cummentàriu

source: Copied
sc: Copiadu

source: Export
sc: Esporta

source: Import
sc: Importa

source: Custom Font
sc: Caràtere personalizadu

source: Empty...
sc: Bòidu...

source: Add
sc: Annanghe

source: Auto Export
sc: Esportatzione automàtica

source: Tags
sc: Etichetas

source: Add Tag
sc: Annanghe un'eticheta

source: Tag Name
sc: Nùmene de s'eticheta

source: Tag List
sc: Lista de etichetas

source: Remove
sc: Boga

source: Confirm
sc: Cunfirma

source: No Result
sc: Perunu resurtadu

# updateAnnouncement
source: The Announcement of Updating to {version}
sc: S'annùntziu de atualizatzione a {version}

source: Description
sc: Descritzione

source: Properties
sc: Propiedades

# removeOneHistory
source: Remove History
sc: Boga sa cronologia

# removeOneHistoryConfirm
source: Are you sure you want to remove '{word}' from history?
sc: Ses seguru de bòlere bogare '{word}' dae sa cronologia?

source: Clear History
sc: Isbòida sa cronologia

# clearHistoryConfirm
source: Are you sure you want to clear history?
sc: Ses seguru de bòlere isboidare sa cronologia?

source: Default
sc: Predefinidu

source: Manage Groups
sc: Manìgia sos grupos

source: Export File Name
sc: Nùmene de s'archìviu de esportatzione

source: Export Directory
sc: Cartella de esportatzione

source: Title
sc: Tìtulu

source: Total Number of Entries
sc: Nùmeru totale de intradas

source: Sponsor
sc: Patrotzinadore

source: More
sc: De prus

source: Auto Remove Search Word
sc: Iscantzella in automàticu sa paràula de chirca

# secureScreen
source: Anti-Screenshot
sc: Blocu de sas ischermadas

source: Search Bar Location
sc: Positzione de s'istanga de chirca

source: Top
sc: In artu

source: Bottom
sc: In bassu

source: Sidebar Icon
sc: Icona de s'istanga laterale

source: Export Path
sc: Àndala de esportatzione

source: Edit Word
sc: Modìfica sa paràula

source: Notification
sc: Notìfica

source: More Options Button
sc: Butone de àteras optziones

source: Title Alias
sc: Àlias de tìtulu

source: Skip Tagged Word
sc: Brinca sa paràula etichetada

source: Dictionary Groups
sc: Grupos de ditzionàrios

source: History
sc: Cronologia

source: Appearance
sc: Aparèntzia

source: Privacy
sc: Riservadesa

source: Privacy Policy
sc: Polìtica de riservadesa

source: AI Settings
sc: Impostatziones de IA

source: AI Provider
sc: Frunidore de IA

source: AI Model
sc: Modellu de IA

source: API Key
sc: Crae API

source: AI Explain Word
sc: IA isprica paràula

source: Output Type
sc: Tipu de essida

source: Rich Output
sc: Essida rica

source: Simple Output
sc: Essida simpre

source: Enter text to translate
sc: Inserta testu de tradùere

source: Translate
sc: Tradue

source: Source Language
sc: Limba de orìgine

source: Target Language
sc: Limba de destinatzione

source: Terms of Service
sc: Tèrmines de servìtziu

source: Auto Detect
sc: Atzapadura automàtica

source: Check for Updates
sc: Chirca atualizatziones

source: Update Available
sc: Atualizatzione a disponimentu

# updateAvailableContent
source: New version {version} is available. Do you want to update?
sc: Sa versione noa {version} est a disponimentu. Boles atualizare?

source: Update
sc: Atualiza

source: No update available
sc: Peruna atualizatzione a disponimentu

# updateCheckFailed
source: Check update failed
sc: Faddina in sa verìfica de s'atualizatzione

# includePrerelease
source: Include Prerelease Updates
sc: Inclui versiones preliminares

source: Checking for updates...
sc: Chirchende atualizatziones...

# aiExplainWordPrompt
source: Explain Word Prompt
sc: Indicatzione de ispricatzione de paràula

# customExplainPromptHelper
source: You can use $word and $targetLanguage in your prompt.
sc: Podes impreare $word e $targetLanguage in s'indicatzione.

source: AI Translate Prompt
sc: Indicatzione de tradutzione AI

# customTranslatePromptHelper
source: You can use $sourceLanguage, $targetLanguage, and $text in your prompt.
sc: Podes impreare $sourceLanguage, $targetLanguage e $text in s'indicatzione.

# tabBarPosition
source: TabBar Position in Word Display
sc: Positzione de s'istanga de sas ischedas in s’ammustramentu de sa paràula

# showSearchBarInWordDisplayPage
source: Show Search Bar in Word Display
sc: Ammustra s'istanga de chirca in s'ammustramentu de sa paràula

source: Auto Update
sc: Atualizatzione automàtica

# legacyImport
source: Import (Legacy, will be removed in future)
sc: Importatzione eredada (at a èssere bogada in su benidore)

source: Audio Settings
sc: Impostatziones àudio

source: TTS Engines
sc: Motores TTS

source: TTS Languages
sc: Limbas TTS

source: API Url
sc: URL de s'API

source: Floating Window
sc: Ventana flotante

source: Loading...
sc: Carrighende...

# addingWord
source: Adding Word: {word}
sc: Annanghende paràula: {word}

source: Copying Files...
sc: Copiende archìvios...

# addingResource
source: Adding Resource: {resource}
sc: Annanghende risorsa: {resource}

source: Enable History
sc: Ativa sa cronologia

# advanceSwitchDescription
source: Enable to show more settings options
sc: Ativa pro ammustrare àteras optziones de impostatzione

source: Other
sc: Àteru

source: Backup
sc: Còpia de seguresa

source: About
sc: In contu de

source: Advance
sc: Avantzadu

source: Changelog
sc: Registru de sas mudàntzias

source: Edit AI Explanation
sc: Modìfica s'ispricatzione de s'IA

source: Enter AI Explanation
sc: Inserta s'ispricatzione de s'IA

source: Save
sc: Sarva

source: Dictionary Switch Style
sc: Istile de càmbiu de ditzionàriu

source: Expansion
sc: Espansione

source: Manage Storage
sc: Manìgia s'archiviatzione

source: Confirm Delete
sc: Cunfirma s'iscantzelladura

# confirmDeleteMessage
source: Are you sure you want to delete '{name}'?
sc: Ses seguru de bòlere iscantzellare '{name}'?

source: Delete
sc: Iscantzella

source: Cancel
sc: Annulla

source: Back
sc: In segus

# dictionaryFileNotFound
source: Dictionary file not found. Removing from database.
sc: Archìviu de ditzionàriu non agatadu. Boghende dae sa base de datos.

# confirmDeleteWords
source: Are you sure you want to delete the selected {count} words?
sc: Ses seguru de bòlere iscantzellare sas {count} paràulas seberadas?

source: Writing Check
sc: Verìfica de iscritura

# label_enter_to_check
source: Enter text to check
sc: Inserta su testu de verificare

source: Check
sc: Verìfica

source: Reset to Default
sc: Torra a su predefinidu

# writingCheckPromptTitle
source: Writing Check Prompt
sc: Indicatzione de verìfica de iscritura

# writingCheckPromptHelper
source: You can use $text and $targetLanguage in your prompt.
sc: Podes impreare $text in s'indicatzione.

source: Logs
sc: Registros

source: Translation Provider
sc: Frunidore de tradutzione

source: Search language
sc: Limba de chirca

source: Writing Check History
sc: Cronologia de verìfica de iscritura

# nSelected
source: {count} selected
sc: {count} seberados

source: Translation History
sc: Cronologia de tradutzione

source: Enable Translation History
sc: Ativa sa cronologia de tradutzione

source: Enable Writing Check History
sc: Ativa sa cronologia de verìfica de iscritura
